
## Plan Result (sbox)




<pre><code>Plan: 6 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.appInsights-InstrumentationKey
  * module.vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.vault.azurerm_key_vault_access_policy.developer[0]
  * module.vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;60ab1441-a8a9-4990-aa30-c94e9f0b047b&#34;]
  * module.vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
* Update
  * azurerm_resource_group.shared_resource_group
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.vault.azurerm_key_vault.kv
  * module.vault.azurerm_user_assigned_identity.managed_identity[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appInsights-InstrumentationKey will be created
  + resource "azurerm_key_vault_secret" "appInsights-InstrumentationKey" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox/providers/Microsoft.KeyVault/vaults/applesi-sbox"
      + name                    = "appInsights-InstrumentationKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.shared_resource_group will be updated in-place
  ~ resource "azurerm_resource_group" "shared_resource_group" {
        id         = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox"
        name       = "apple-shared-infrastructure-sbox"
      ~ tags       = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2025-09-10" -> "3000-01-01"
            "managedBy"           = "Platform Operations"
            "startupMode"         = "onDemand"
        }
        # (2 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox/providers/Microsoft.Insights/components/apple-sbox"
        name                                  = "apple-sbox"
      ~ tags                                  = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2025-09-10" -> "3000-01-01"
            "managedBy"           = "Platform Operations"
            "startupMode"         = "onDemand"
        }
        # (16 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - apple-sbox"
        name                = "Application Insights daily cap reached - apple-sbox"
      ~ tags                = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2025-09-10" -> "3000-01-01"
            "managedBy"           = "Platform Operations"
            "startupMode"         = "onDemand"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox/providers/Microsoft.ServiceBus/namespaces/apple-servicebus-sbox"
        name                                = "apple-servicebus-sbox"
      ~ tags                                = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2025-09-10" -> "3000-01-01"
            "managedBy"           = "Platform Operations"
            "startupMode"         = "onDemand"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox/providers/Microsoft.KeyVault/vaults/applesi-sbox"
        name                            = "applesi-sbox"
      ~ tags                            = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2025-09-10" -> "3000-01-01"
            "managedBy"           = "Platform Operations"
            "startupMode"         = "onDemand"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox/providers/Microsoft.KeyVault/vaults/applesi-sbox"
      + object_id               = "5356a0e7-324e-4efa-970b-4b4aec3f0ba3"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox/providers/Microsoft.KeyVault/vaults/applesi-sbox"
      + object_id               = "7bde62e7-b39f-487c-95c9-b4c794fdbb96"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_key_vault_access_policy.managed_identity_access_policy["60ab1441-a8a9-4990-aa30-c94e9f0b047b"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox/providers/Microsoft.KeyVault/vaults/applesi-sbox"
      + object_id               = "60ab1441-a8a9-4990-aa30-c94e9f0b047b"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox/providers/Microsoft.KeyVault/vaults/applesi-sbox"
      + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                           = "applesi-sbox"
      + target_resource_id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/apple-shared-infrastructure-sbox/providers/Microsoft.KeyVault/vaults/applesi-sbox"

      + enabled_log {
          + category       = "AuditEvent"
            # (1 unchanged attribute hidden)
        }

      + log (known after apply)
    }

  # module.vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/managed-identities-sbox-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/apple-sbox-mi"
        name                = "apple-sbox-mi"
      ~ tags                = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2025-09-10" -> "3000-01-01"
            "managedBy"           = "Platform Operations"
            "startupMode"         = "onDemand"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":138,"Program":"tfcmt","SHA1":"","Target":"sbox","Vars":{}} -->